Revit 2027 API
IndexStreamLine.AddLines Method
 Inserts multiple IndexLine segments into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddLines(
	IList<IndexLine> lines
)
Public Sub AddLines (
	lines As IList(Of IndexLine)
)
public:
void AddLines(
	IList<IndexLine^>^ lines
)
member AddLines :
        lines : IList<IndexLine> -> unit
Parameters
lines IList<IndexLine>
 The line segments to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace